anachrocomputer/PIC32GC/PIC32GameCube.X/GameCube.c
    OC1RS = 256;
    
    OC1CONbits.ON = 1;          // Enable OC1 PWM
            
    /* Configure Timer 1 */
    T1CONbits.TCKPS = 0;        // Timer 1 prescale: 1
    
    TMR1 = 0x00;                // Clear Timer 1 counter
    PR1 = 39999;                // Interrupt every 40000 ticks (1ms)
    
    T1CONbits.ON = 1;           // Enable Timer 1
    
    /* Configure Timer 4 */
    T4CONbits.TCKPS = 0;        // Timer 4 prescale: 1
    
    TMR4 = 0x00;                // Clear Timer 4 counter
    PR4 = 906;                  // Interrupt every 907 ticks (44100Hz)
    
    T4CONbits.ON = 1;           // Enable Timer 4
    
    /* Configure interrupts */
    INTCONSET = _INTCON_MVEC_MASK; // Multi-vector mode
    
    IPC1bits.T1IP = 2;          // Timer 1 interrupt priority 2
    IPC1bits.T1IS = 1;          // Timer 1 interrupt sub-priority 1
    IFS0CLR = _IFS0_T1IF_MASK;  // Clear Timer 1 interrupt flag
    IEC0SET = _IEC0_T1IE_MASK;  // Enable Timer 1 interrupt
    
    IPC4bits.T4IP = 4;          // Timer 4 interrupt priority 4
    IPC4bits.T4IS = 1;          // Timer 4 interrupt sub-priority 1
    IFS0CLR = _IFS0_T4IF_MASK;  // Clear Timer 4 interrupt flag
    IEC0SET = _IEC0_T4IE_MASK;  // Enable Timer 4 interrupt
    
    delta = (2.0 * M_PI) / 4096.0;
    
    for (i = 0; i < 4096; i++)
    {
        Sinbuf[i] = (sin(delta * (double)i) * 2047.0) + 2048.0;
    }
    
    __asm__("EI");              // Global interrupt enable
    
    OLED_begin(MAXX, 32);
    
    puts("DDS");
    
    while (1)
    {
        U1TXREG = 'A';
        DDS_SetFreq(440);
        greyFrame();
    
        updscreen();
        
        LED1 = 0;
        LED2 = 1;
        LED3 = 1;
        LED4 = 1;
        LED5 = 1;
        
        OC1RS = 0;
        
        delayms(500);
        
        ana = analogRead(6);
        
        printf("%dms %d\r\n", millis(), ana);
        
        DDS_SetFreq(440 * 2);
        
        LED1 = 1;
        LED2 = 0;
        
        OC1RS = 128;
        
        delayms(500);
        memcpy(Frame, DdsLogo, sizeof (Frame));
    
        updscreen();
        
        U3TXREG = 'C';
        DDS_SetFreq(440 * 4);
        
        LED2 = 1;
        LED3 = 0;
        
        OC1RS = 256;
        
        delayms(500);
        
        U4TXREG = 'D';
        DDS_SetFreq(440 * 8);
        
        LED3 = 1;
        LED4 = 0;
        
        OC1RS = 512;
        
        delayms(500);
        
        U5TXREG = 'E';
        DDS_SetFreq(220);
        
        LED4 = 1;
        LED5 = 0;
        
        OC1RS = 1023;
        
        delayms(500);
    }
}

